DisableTemporaryViewMode Method
 Disables the specified temporary view mode.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public void DisableTemporaryViewMode(
	TemporaryViewMode mode
)
Visual Basic
Public Sub DisableTemporaryViewMode ( _
	mode As TemporaryViewMode _
)
Visual C++
public:
void DisableTemporaryViewMode(
	TemporaryViewMode mode
)
Parameters
mode
Type: Autodesk.Revit.DBTemporaryViewMode
 The mode to disable.
Remarks
 Has no effect if the mode is already disabled.
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
Autodesk.Revit.ExceptionsInvalidOperationException |  View cannot use temporary visibility modes.
See Also
View Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →